index.org
#+TITLE: Data Compression Techniques
#+SUBTITLE: An overview of some data compression techniques
#+AUTHOR: Ashiwn Godbole
#+LATEX_HEADER: \usepackage[margin=0.5in]{geometry}
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-bigblow.setup

* Data Compression Techniques
Data compression techniques fall into different categories depending on the principle used to develop them.
Most often a combination of different techniques is used to perform compression in real life, since some encoding schemes produce outputs that are not compressed so much, but that can be further compressed efficiently using other techniques.

** Statistical/Entropy Coding Techniques

*** Run Length Coding
- good technique when compressing data that has frequent sequences of repeating characters
- emit a pair (character, length)
- in case there are no repeating characters, results in a "compressed" file that is actually expanded in size because for each 8bit character, we use 8bits + 8bits (say) for the pair
- /*parameters* : repititions in source string (generally no user-settable parameter)/

*** Shannon Fano Coding
- uses probabilities of the characters in the string to assign codes to each character
- the codes are built in a top-down fashion
  - start at the root and keep dividing "nodes"
- the process involves the following:
  1. calculate the probabilities of every character and create a table
  2. sort the table in order of probabilities
  3. divide the table into two such that the resulting tables have approximately the same total probability
  4. assign one table "0" and the other "1"
  5. until all the tables have only one element each, repeating from 'step 3'
- the limitation of this technique is that it does not always produce the optimal sequence
- codeword lengths are within 1 bit of the optimal codes
- have the limitation imposed by integral number of bits per character to encode
- works best in cases where the probabilities of different characters are in powers of two
- decoder requires
  - probability table (to reconstruct the codes in the exact same manner as the encoder)
  - direct mapping between codes and characters in some other form
- /*parameters* : probabilities of occurance of characters (generally no user-settable parameter)/

