index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-07-10 Sun 17:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Data Compression Techniques</title>
<meta name="author" content="Ashiwn Godbole" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/hideshow.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Data Compression Techniques
<br />
<span class="subtitle">An overview of some data compression techniques</span>
</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org9c970c2">1. Data Compression Techniques</a>
<ul>
<li><a href="#orgcc72ad3">1.1. Statistical/Entropy Coding Techniques</a>
<ul>
<li><a href="#org2e0298f">1.1.1. Run Length Coding</a></li>
<li><a href="#org7439b49">1.1.2. Shannon Fano Coding</a></li>
<li><a href="#org9ceb48c">1.1.3. Huffman Coding</a></li>
<li><a href="#orgef6992b">1.1.4. Arithmetic Coding</a></li>
</ul>
</li>
<li><a href="#orgeb82c59">1.2. Burrows Wheeler Transform</a></li>
<li><a href="#orgc5bf41b">1.3. Dictionary Techniques</a>
<ul>
<li><a href="#orgb229edc">1.3.1. LZ77</a></li>
<li><a href="#org654408c">1.3.2. LZ78</a></li>
<li><a href="#org0c00bea">1.3.3. Some differences between LZ77 and LZ78 schemes</a></li>
<li><a href="#org7bc808c">1.3.4. LZSS</a></li>
<li><a href="#org904ec15">1.3.5. LZW</a></li>
<li><a href="#org5b2a874">1.3.6. snappy</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org9c970c2" class="outline-2">
<h2 id="org9c970c2"><span class="section-number-2">1.</span> Data Compression Techniques</h2>
<div class="outline-text-2" id="text-1">
<p>
Data compression techniques fall into different categories depending on the principle used to develop them.
Most often a combination of different techniques is used to perform compression in real life, since some encoding schemes produce outputs that are not compressed so much, but that can be further compressed efficiently using other techniques.
</p>
</div>

<div id="outline-container-orgcc72ad3" class="outline-3">
<h3 id="orgcc72ad3"><span class="section-number-3">1.1.</span> Statistical/Entropy Coding Techniques</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org2e0298f" class="outline-4">
<h4 id="org2e0298f"><span class="section-number-4">1.1.1.</span> Run Length Coding</h4>
<div class="outline-text-4" id="text-1-1-1">
<ul class="org-ul">
<li>good technique when compressing data that has frequent sequences of repeating characters</li>
<li>emit a pair (character, length)</li>
<li>in case there are no repeating characters, results in a "compressed" file that is actually expanded in size because for each 8bit character, we use 8bits + 8bits (say) for the pair</li>
<li><i><b>parameters</b> : repititions in source string (generally no user-settable parameter)</i></li>
</ul>
</div>
</div>

<div id="outline-container-org7439b49" class="outline-4">
<h4 id="org7439b49"><span class="section-number-4">1.1.2.</span> Shannon Fano Coding</h4>
<div class="outline-text-4" id="text-1-1-2">
<ul class="org-ul">
<li>uses probabilities of the characters in the string to assign codes to each character</li>
<li>the codes are built in a top-down fashion
<ul class="org-ul">
<li>start at the root and keep dividing "nodes"</li>
</ul></li>
<li>the process involves the following:
<ol class="org-ol">
<li>calculate the probabilities of every character and create a table</li>
<li>sort the table in order of probabilities</li>
<li>divide the table into two such that the resulting tables have approximately the same total probability</li>
<li>assign one table "0" and the other "1"</li>
<li>until all the tables have only one element each, repeating from 'step 3'</li>
</ol></li>
<li>the limitation of this technique is that it does not always produce the optimal sequence</li>
<li>codeword lengths are within 1 bit of the optimal codes</li>
<li>have the limitation imposed by integral number of bits per character to encode</li>
<li>works best in cases where the probabilities of different characters are in powers of two</li>
<li>decoder requires
<ul class="org-ul">
<li>probability table (to reconstruct the codes in the exact same manner as the encoder)</li>
<li>direct mapping between codes and characters in some other form</li>
</ul></li>
<li><i><b>parameters</b> : probabilities of occurance of characters (generally no user-settable parameter)</i></li>
</ul>
</div>
</div>
