index.org
*** Huffman Coding
- similar in principle to shannon-fano coding
- follows a bottoms-up approach
  - start with leaf nodes and build till convergence is achieved
- the process involves the following
  1. create a list of nodes (one per node) with the probabilities of occurance for that character
  2. pick the two nodes with least probability and make a new node with its probability set to the sum of probabilities of the two nodes
  3. delete the two nodes
  4. goto 'step 2' if there are two or more nodes left
- the constraint of having integral bits per character applies here as well
  - when the probabilities are powers or two, huffman codes give the optimal coding
  - in other cases, the integral bits per character constraint causes characters with probability less than a power of two to have a "fractional bit overhead" and for those with higher probability than a power of two, there is a fractional bit deficit
  - depending on how the probabilities are, the overhead and the deficit result in an overall overhead (unless ofcourse the probabilities are all powers of two)
- this technique also requires the information about probabilities to be handed over to the decode in some form
- one way to attempt at sidestepping the integral number of bits per symbol is to try code for a group of two or more symbols
  - /if the events of the characters in the group are *independent*/ then the probability of the group as a whole is just the product of the individual elements' probabilities
  - problems arise as we try to increase the size of the groups
  - if our message is coded over an alphabet of /m/ letters
    - for a group of 2 elements, we would have $m^2$ entries in the table
    - for a group of 3 elements, we would have $m^3$ entries in the table
    - for a group of /n/ elements, we would have $m^n$ entries in the table
  - it is not practical to evaluate and distribute such large tables as they will end up causing more overhead than the bits saved during compression (also in terms of computation required, this will be very taxing)
- one way to avoid the overhead due to this extra information is to use an adaptive version of the algorithm
  - in the adaptive case, a huffman tree is built on the fly as per the arriving symbol in both the encoder and the decoder
  - each node is attached a "weight" which is the probability and a "number"
  - the "number"s are assigned bottom-to-top and left-to-right
  - it needs to be ensured that if we order the nodes according to weights $$w_1 < w_2 < ... < w_{(2m-1)}$$ then $$n_1 < n_2 < ... < n_{(2m-1)}$$ which besically means that a node with heigher weight must have a higher number
    - /the 2m - 1 comes from the fact that each node in a huffman tree must have a sibling, except for the root/
    - this also means that a parent node must have a higher "number" assigned to it than its children
    - note: /set of nodes that have the same weight/ is called a /block/
  - the UPDATE process is required when a new symbol arrives (at the encoder and decoder):
  - the process of encoding and decoding starts off with a "Not Yet Transmitted" or "NYT" node
  - everytime a new symbol arrives
    - if it is seen for the first time, split the NYT node into two, assign one of the childen the current symbol, and make the other one the new NYT
    - if it has been seen before, visit the symbols node
      - if it has the highest node number in its block, then increment its node number
      - otherwise swap the node with the node with the highest node number in its block and then increment it
    - go to the parent of the currently selected node and repeat till the root node is reached
  - the advantage of building the tree on the fly is that we can avoid the overhead required for packaging the probabilities with the compressed data
    - The algorithm is not free of the integral bits per character constrint though, so we still are not able to exactly reach entropy in most cases
- /*parameters*/ :
  - /probabilities of occurance of characters/
  - /number of characters to clump together for encoding (use-settable)/

*** Arithmetic Coding
- the other techniques mentioned till now all suffer from one common problem
  - they all require an integral number of bits per symbol
- arithmetic coding is a technique that tries to sidestep that problem by changing how strings are encoded
- this scheme tries to encode whole strings rather than encoding single elements
- this technique also requires knowledge of the probabilities of the different symbols in the string
- the procedure is as follows:
  1. start with the interval [0.0, 1.0)
  2. divide the interval according to the probabilities of the characters in the character set
  3. read a character
  4. zoom into the range set by the character just read
  5. repeat 'step 3' till the end of stream character is encountered
  6. once done, choose a number in the region formed that requires the least amount of bits to represent
- this technique basically represents an entire block of the source text as a single real point number, which can be used to obtain the source text by repeating the same zooming process till the end of stream symbol is encountered
- this ofcourse needs infinite precision numbers, which would require an inifinite precision mathematics, which is difficult to perform efficiently
- there are variations and techniques that allow for 16bit, 32bit precicion coding
- we need a solution to the "infinite precision in finite bits" problem
- since we do not have infinite bits to represent out fractions, we end up clipping long fraction that causes deviation from efficiency being the entropy
  - the error can be minimized so that we achieve as close to entropy efficiency as possible
- as the arithmetic coding process continues, the lower and upper bound of the range start to share their upper bits
  - this is a significant observation because it means that if the bounds share some bits, in the next step they will either share the same or more number of bits
  - we can ignore these bits therefore, as once they match, they are inconsequential to further calculations
  - this allows us to use "fixed point" representations for out bounds
  - we simply move out the bits that match ensuring that we can keep going deeper and deeper into as small of ranges as we want

