index.html

<div id="outline-container-org9ceb48c" class="outline-4">
<h4 id="org9ceb48c"><span class="section-number-4">1.1.3.</span> Huffman Coding</h4>
<div class="outline-text-4" id="text-1-1-3">
<ul class="org-ul">
<li>similar in principle to shannon-fano coding</li>
<li>follows a bottoms-up approach
<ul class="org-ul">
<li>start with leaf nodes and build till convergence is achieved</li>
</ul></li>
<li>the process involves the following
<ol class="org-ol">
<li>create a list of nodes (one per node) with the probabilities of occurance for that character</li>
<li>pick the two nodes with least probability and make a new node with its probability set to the sum of probabilities of the two nodes</li>
<li>delete the two nodes</li>
<li>goto 'step 2' if there are two or more nodes left</li>
</ol></li>
<li>the constraint of having integral bits per character applies here as well
<ul class="org-ul">
<li>when the probabilities are powers or two, huffman codes give the optimal coding</li>
<li>in other cases, the integral bits per character constraint causes characters with probability less than a power of two to have a "fractional bit overhead" and for those with higher probability than a power of two, there is a fractional bit deficit</li>
<li>depending on how the probabilities are, the overhead and the deficit result in an overall overhead (unless ofcourse the probabilities are all powers of two)</li>
</ul></li>
<li>this technique also requires the information about probabilities to be handed over to the decode in some form</li>
<li>one way to attempt at sidestepping the integral number of bits per symbol is to try code for a group of two or more symbols
<ul class="org-ul">
<li><i>if the events of the characters in the group are <b>independent</b></i> then the probability of the group as a whole is just the product of the individual elements' probabilities</li>
<li>problems arise as we try to increase the size of the groups</li>
<li>if our message is coded over an alphabet of <i>m</i> letters
<ul class="org-ul">
<li>for a group of 2 elements, we would have \(m^2\) entries in the table</li>
<li>for a group of 3 elements, we would have \(m^3\) entries in the table</li>
<li>for a group of <i>n</i> elements, we would have \(m^n\) entries in the table</li>
</ul></li>
<li>it is not practical to evaluate and distribute such large tables as they will end up causing more overhead than the bits saved during compression (also in terms of computation required, this will be very taxing)</li>
</ul></li>
<li>one way to avoid the overhead due to this extra information is to use an adaptive version of the algorithm
<ul class="org-ul">
<li>in the adaptive case, a huffman tree is built on the fly as per the arriving symbol in both the encoder and the decoder</li>
<li>each node is attached a "weight" which is the probability and a "number"</li>
<li>the "number"s are assigned bottom-to-top and left-to-right</li>
<li>it needs to be ensured that if we order the nodes according to weights \[w_1 < w_2 < ... < w_{(2m-1)}\] then \[n_1 < n_2 < ... < n_{(2m-1)}\] which besically means that a node with heigher weight must have a higher number
<ul class="org-ul">
<li><i>the 2m - 1 comes from the fact that each node in a huffman tree must have a sibling, except for the root</i></li>
<li>this also means that a parent node must have a higher "number" assigned to it than its children</li>
<li>note: <i>set of nodes that have the same weight</i> is called a <i>block</i></li>
</ul></li>
<li>the UPDATE process is required when a new symbol arrives (at the encoder and decoder):</li>
<li>the process of encoding and decoding starts off with a "Not Yet Transmitted" or "NYT" node</li>
<li>everytime a new symbol arrives
<ul class="org-ul">
<li>if it is seen for the first time, split the NYT node into two, assign one of the childen the current symbol, and make the other one the new NYT</li>
<li>if it has been seen before, visit the symbols node
<ul class="org-ul">
<li>if it has the highest node number in its block, then increment its node number</li>
<li>otherwise swap the node with the node with the highest node number in its block and then increment it</li>
</ul></li>
<li>go to the parent of the currently selected node and repeat till the root node is reached</li>
</ul></li>
<li>the advantage of building the tree on the fly is that we can avoid the overhead required for packaging the probabilities with the compressed data
<ul class="org-ul">
<li>The algorithm is not free of the integral bits per character constrint though, so we still are not able to exactly reach entropy in most cases</li>
</ul></li>
</ul></li>
<li><i><b>parameters</b></i> :
<ul class="org-ul">
<li><i>probabilities of occurance of characters</i></li>
<li><i>number of characters to clump together for encoding (use-settable)</i></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgef6992b" class="outline-4">
<h4 id="orgef6992b"><span class="section-number-4">1.1.4.</span> Arithmetic Coding</h4>
<div class="outline-text-4" id="text-1-1-4">
<ul class="org-ul">
<li>the other techniques mentioned till now all suffer from one common problem
<ul class="org-ul">
<li>they all require an integral number of bits per symbol</li>
</ul></li>
<li>arithmetic coding is a technique that tries to sidestep that problem by changing how strings are encoded</li>
<li>this scheme tries to encode whole strings rather than encoding single elements</li>
<li>this technique also requires knowledge of the probabilities of the different symbols in the string</li>
<li>the procedure is as follows:
<ol class="org-ol">
<li>start with the interval [0.0, 1.0)</li>
<li>divide the interval according to the probabilities of the characters in the character set</li>
<li>read a character</li>
<li>zoom into the range set by the character just read</li>
<li>repeat 'step 3' till the end of stream character is encountered</li>
<li>once done, choose a number in the region formed that requires the least amount of bits to represent</li>
</ol></li>
<li>this technique basically represents an entire block of the source text as a single floating point number, which can be used to obtain the source text by repeating the same zooming process till the end of stream symbol is encountered</li>
<li>this ofcourse needs infinite precision numbers, which would require an inifinite precision mathematics, which is difficult to perform efficiently</li>
<li>there are variations and techniques that allow for 16bit, 32bit precicion coding</li>
<li>we need a solution to the "infinite precision in finite bits" problem</li>
<li>since we do not have infinite bits to represent out fractions, we end up clipping long fraction that causes deviation from efficiency being the entropy
<ul class="org-ul">
<li>the error can be minimized so that we achieve as close to entropy efficiency as possible</li>
</ul></li>
<li>as the arithmetic coding process continues, the lower and upper bound of the range start to share their upper bits
<ul class="org-ul">
<li>this is a significant observation because it means that if the bounds share some bits, in the next step they will either share the same or more number of bits</li>
<li>we can ignore these bits therefore, as once they match, they are inconsequential to further calculations</li>
<li>this allows us to use "fixed point" representations for out bounds</li>
<li>we simply move out the bits that match ensuring that we can keep going deeper and deeper into as small of ranges as we want</li>
</ul></li>
</ul>
</div>
</div>
</div>
