index.org
** Burrows Wheeler Transform
- completely different principle when compared to the other techniques described above
- breaks up input into multiple blocks of some fixed size
- uses the /block-sort transform/ to sort the block in a particular manner
- uses the /move-to-front transform/ to convert the sorted contents into a form that is good for other statistical encoders 
- an important observation is that statistical encoders work primarily on the occurance probabilities of characters
  - the probability of occurance does not take into account the "order" or the "context" of occurance of the characters
  - BWT takes the order/context of occurance into account when encoding
- the block-sorting process: (there are some optimizations that can be done, those are not shown for simplicity)
  1. compute all the possible "left cyclic" permutations of the source string
  2. sort the permutations in lexicographical order
  3. extract the last column of the matrix formed by the sorted permutations
  4. extract the position of the original string in the sorted matrix
  5. the last column and the position are the output
- example: source text = BANANA
| permutations | Index | sorted | last column |
|--------------+-------+--------+-------------|
| BANANA       |     1 | ABANAN | N           |
| ANANAB       |     2 | ANABAN | N           |
| NANABA       |     3 | ANANAB | B           |
| ANABAN       |     4 | BANANA | A           |
| NABANA       |     5 | NABANA | A           |
| ABANAN       |     6 | NANABA | A           |
|--------------+-------+--------+-------------|
- output = NNBAAA, 4
- to decode the string, we need only 2 adjecent columns from the sorted table are required
- taking the last column gives us the first column for free (just sorting the last column gives the first column)
- also, since we are rotating towards the left, the first char goes to the end and the second becomes the first... making the last column have the character just left of the first column's character
- so just from the last column we can generate the whole matrix, and then the index that was exported gives the index to the row containing the decoded string
- example : encoded text = NNBAAA, 4
| n | o | s | j  | s  | j   | s   | j    | s    | j     | s     | j      | s      |
| 1 | N | A | NA | AB | NAB | ABA | NABA | ABAN | NABAN | ABANA | NABANA | ABANAN |
| 2 | N | A | NA | AN | NAN | ANA | NANA | ANAB | NANAB | ANABA | NANABA | ANABAN |
| 3 | B | A | BA | AN | BAN | ANA | BANA | ANAN | BANAN | ANANA | BANANA | ANANAB |
| 4 | A | B | AB | BA | ABA | BAN | ABAN | BANA | ABANA | BANAN | ABANAN | *BANANA* |
| 5 | A | N | AN | NA | ANA | NAB | ANAB | NABA | ANABA | NABAN | ANABAN | NABANA |
| 6 | A | N | AN | NA | ANA | NAN | ANAN | NANA | ANANA | NANAB | ANANAB | NANABA |
- /o = output, s = sorted, j = output+previous sorted/
- as can be seen the output is re-formed in the same row pointed to by the index

- the move-to-front process is quite simple as well
  1. prepare the characterset
  2. start from the first character, get its index from the characterset
  3. move the character to the beginning of the characterset
  4. repeat 'step 2' till all the characters are encoded
- the procedure to decode this is also very simple
  1. prepare the characterset
  2. take the character at the index recieved in the encoded string
  3. move the character to the beginning of the characterset
  4. repeat 'step 2' till all the characters are encoded
- why choose the last row?
  - consider an english sentence is to be encoded and it contains many occurances of the word 'has'
  - in all the cyclic rotations of the sentence, many will start with the 'as' from the 'has' and end with the ' of the 'has'
  - when sorted, all these rotations that start with the 'as' are brought together causing the last column to have a cluster of 'h's
  - thus the last row contains clusters of letters which appear in a common pattern
  - hence we choose the last row as the output of the encoder, it has good contextual clustering
- /*parameters*/ :
  - /size of the block of text that we wish to operate on (user-settable)/

** Dictionary Techniques
The Lempel-Ziv algorithms are called dictionary algorithms because they all work in a similar way and require a "dictionary" to be formed while coding and decoding.
The class of algorithms that come under the LZ77 family tree do not construct an explicit dictionary, but instead use the part of the string that has already been decoded/encoded as the dictionary.
On the other hand, the LZ78 family of algorithms maintain a separate explicit dictionary while coding and encoding (the dictionary itself depends only on the part of the string already seen).
These algorithms in general work on the principle that if a pattern has been seen before, it is probably easier to encode the references to the previous occurance for every re-occurance encounteresd.

