index.html

<div id="outline-container-orgeb82c59" class="outline-3">
<h3 id="orgeb82c59"><span class="section-number-3">1.2.</span> Burrows Wheeler Transform</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>completely different principle when compared to the other techniques described above</li>
<li>breaks up input into multiple blocks of some fixed size</li>
<li>uses the <i>block-sort transform</i> to sort the block in a particular manner</li>
<li>uses the <i>move-to-front transform</i> to convert the sorted contents into a form that is good for other statistical encoders</li>
<li>an important observation is that statistical encoders work primarily on the occurance probabilities of characters
<ul class="org-ul">
<li>the probability of occurance does not take into account the "order" or the "context" of occurance of the characters</li>
<li>BWT takes the order/context of occurance into account when encoding</li>
</ul></li>
<li>the block-sorting process: (there are some optimizations that can be done, those are not shown for simplicity)
<ol class="org-ol">
<li>compute all the possible "left cyclic" permulations of the source string</li>
<li>sort the permulations in lexicographical order</li>
<li>extract the last column of the matrix formed by the sorted permulations</li>
<li>extract the position of the original string in the sorted matrix</li>
<li>the last column and the position are the output</li>
</ol></li>
<li>example: source text = BANANA</li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">permulations</th>
<th scope="col" class="org-right">Index</th>
<th scope="col" class="org-left">sorted</th>
<th scope="col" class="org-left">last column</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">BANANA</td>
<td class="org-right">1</td>
<td class="org-left">ABANAN</td>
<td class="org-left">N</td>
</tr>

<tr>
<td class="org-left">ANANAB</td>
<td class="org-right">2</td>
<td class="org-left">ANABAN</td>
<td class="org-left">N</td>
</tr>

<tr>
<td class="org-left">NANABA</td>
<td class="org-right">3</td>
<td class="org-left">ANANAB</td>
<td class="org-left">B</td>
</tr>

<tr>
<td class="org-left">ANABAN</td>
<td class="org-right">4</td>
<td class="org-left">BANANA</td>
<td class="org-left">A</td>
</tr>

<tr>
<td class="org-left">NABANA</td>
<td class="org-right">5</td>
<td class="org-left">NABANA</td>
<td class="org-left">A</td>
</tr>

<tr>
<td class="org-left">ABANAN</td>
<td class="org-right">6</td>
<td class="org-left">NANABA</td>
<td class="org-left">A</td>
</tr>
</tbody>
</table>
<ul class="org-ul">
<li>output = NNBAAA, 4</li>
<li>to decode the string, we need only 2 adjecent columns from the sorted table are required</li>
<li>taking the last column gives us the first column for free (just sorting the last column gives the first column)</li>
<li>also, since we are rotating towards the left, the first char goes to the end and the second becomes the first&#x2026; making the last column have the character just left of the first column's character</li>
<li>so just from the last column we can generate the whole matrix, and then the index that was exported gives the index to the row containing the decoded string</li>
<li>example : encoded text = NNBAAA, 4</li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right">n</td>
<td class="org-left">o</td>
<td class="org-left">s</td>
<td class="org-left">j</td>
<td class="org-left">s</td>
<td class="org-left">j</td>
<td class="org-left">s</td>
<td class="org-left">j</td>
<td class="org-left">s</td>
<td class="org-left">j</td>
<td class="org-left">s</td>
<td class="org-left">j</td>
<td class="org-left">s</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-left">N</td>
<td class="org-left">A</td>
<td class="org-left">NA</td>
<td class="org-left">AB</td>
<td class="org-left">NAB</td>
<td class="org-left">ABA</td>
<td class="org-left">NABA</td>
<td class="org-left">ABAN</td>
<td class="org-left">NABAN</td>
<td class="org-left">ABANA</td>
<td class="org-left">NABANA</td>
<td class="org-left">ABANAN</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">N</td>
<td class="org-left">A</td>
<td class="org-left">NA</td>
<td class="org-left">AN</td>
<td class="org-left">NAN</td>
<td class="org-left">ANA</td>
<td class="org-left">NANA</td>
<td class="org-left">ANAB</td>
<td class="org-left">NANAB</td>
<td class="org-left">ANABA</td>
<td class="org-left">NANABA</td>
<td class="org-left">ANABAN</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">B</td>
<td class="org-left">A</td>
<td class="org-left">BA</td>
<td class="org-left">AN</td>
<td class="org-left">BAN</td>
<td class="org-left">ANA</td>
<td class="org-left">BANA</td>
<td class="org-left">ANAN</td>
<td class="org-left">BANAN</td>
<td class="org-left">ANANA</td>
<td class="org-left">BANANA</td>
<td class="org-left">ANANAB</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">A</td>
<td class="org-left">B</td>
<td class="org-left">AB</td>
<td class="org-left">BA</td>
<td class="org-left">ABA</td>
<td class="org-left">BAN</td>
<td class="org-left">ABAN</td>
<td class="org-left">BANA</td>
<td class="org-left">ABANA</td>
<td class="org-left">BANAN</td>
<td class="org-left">ABANAN</td>
<td class="org-left"><b>BANANA</b></td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">A</td>
<td class="org-left">N</td>
<td class="org-left">AN</td>
<td class="org-left">NA</td>
<td class="org-left">ANA</td>
<td class="org-left">NAB</td>
<td class="org-left">ANAB</td>
<td class="org-left">NABA</td>
<td class="org-left">ANABA</td>
<td class="org-left">NABAN</td>
<td class="org-left">ANABAN</td>
<td class="org-left">NABANA</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-left">A</td>
<td class="org-left">N</td>
<td class="org-left">AN</td>
<td class="org-left">NA</td>
<td class="org-left">ANA</td>
<td class="org-left">NAN</td>
<td class="org-left">ANAN</td>
<td class="org-left">NANA</td>
<td class="org-left">ANANA</td>
<td class="org-left">NANAB</td>
<td class="org-left">ANANAB</td>
<td class="org-left">NANABA</td>
</tr>
</tbody>
</table>
<ul class="org-ul">
<li><i>o = output, s = sorted, j = output+previous sorted</i></li>
<li>as can be seen the output is re-formed in the same row pointed to by the index</li>

<li>the move-to-front process is quite simple as well
<ol class="org-ol">
<li>prepare the characterset</li>
<li>start from the first character, get its index from the characterset</li>
<li>move the character to the begginging of the characterset</li>
<li>repeat 'step 2' till all the characters are encoded</li>
</ol></li>
<li>the procedure to decode this is also very simple
<ol class="org-ol">
<li>prepare the characterset</li>
<li>take the character at the index recieved in the encoded string</li>
<li>move the character to the begining of the characterset</li>
<li>repeat 'step 2' till all the characters are encoded</li>
</ol></li>
<li>why choose the last row?
<ul class="org-ul">
<li>consider an english sentence is to be encoded and it contains many occurances of the word 'has'</li>
<li>in all the cyclic rotations of the sentence, many will start with the 'as' from the 'has' and end with the ' of the 'has'</li>
<li>when sorted, all these rotations that start with the 'as' are brought together causing the last column to have a cluster of 'h's</li>
<li>thus the last row contains clusters of letters which appear in a common pattern</li>
<li>hence we choose the last row as the output of the encoder, it has good contextual clustering</li>
</ul></li>
<li><i><b>parameters</b></i> :
<ul class="org-ul">
<li><i>size of the block of text that we wish to operate on (user-settable)</i></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgc5bf41b" class="outline-3">
<h3 id="orgc5bf41b"><span class="section-number-3">1.3.</span> Dictionary Techniques</h3>
<div class="outline-text-3" id="text-1-3">
<p>
The Lempel-Ziv algorithms are called dictionary algorithms because they all work in a similar way and require a "dictionary" to be formed while coding and decoding.
The class of algorithms that come under the LZ77 family tree do not construct an explicit dictionary, but instead use the part of the string that has already been decoded/encoded as the dictionary.
On the other hand, the LZ78 family of algorithms maintain a separate explicit dictionary while coding and encoding (the dictionary itself depends only on the part of the string already seen).
These algorithms in general work on the principle that if a pattern has been seen before, it is probably easier to encode the references to the previous occurance for every re-occurance encounteresd.
</p>
</div>
