index.org
*** LZ77
- in the LZ77 algorithm, a cursor is maintain which tells the algorithm which character being processed at the time
- all the characters that fall to the left of the cursor (the number of characters to be considered depends on the size set) form the /search buffer/
- the characters that fall on the right of the cursor form the /look ahead buffer/
- the referenced emitted by the encoder are of the form <o, l, c>
  - o is the offset, how far back from the current cursor position the match was found, or 0 if no match was found
  - l is the length of the longest match found, or 0 if no match was found
  - c is the character to the immediate right of the match found, or the character itself if no match was found
- the process followed is as follows:
  1. start at the beginning of the string
  2. look backwards /N/ characters and look for the longest match
  3. if there is no match found emit (0, 0, c) where c is the character under the cursor
  4. else emit (o, l, c) according to the descriptions of o, c, l above
  5. repeat from 'step 2' for every character, skipping l characters if match of that length is found else move by 1
- using values of l larger than the dictionary size allows a run-length type encoding to be made
  - if the pattern length is more than search buffer size, copy the search buffer's characters from left to right and circle back to the start till we finish copying 'length' number of characters
- a bit of a problem with the aggressive coding scheme used is that if there are a lot of unmatched characters, instead of just encoding it as the character itself, the encoding is done as 3 numbers which is a waste of a lot of bits
  - /the schemes that came after this try to fix this problem of over aggressively coding the source (eg: LZSS, snappy)/
- /*parameters*/ :
  - /the size of the search buffer (user-settable)/
    - the larger the search buffer
      - the longer back you can search
      - the more bits you need to represent the offset
      - but you can get references for things that you may not get references for if the search buffer is small
  - /maximum value for longest match (user-settable)/
    - if the longest match length is large we need more bits to represent its value in memory

*** LZ78
- in the LZ78 algorithm too, a cursor is maintain which tells the algorithm which character being processed at the time
- in this algorithm, an explicit dictionary is maintained in memory as the encoding and decoding takes place
- the dictionary is maintained in the form of hashtables or tries
- the dictionary is filled as the cursor moves from the beginning of the source text to the end, using only the characters/patterns visited till that point
  - this property is important, because it allows the decoder to follow the exact same process as the encoder while decoding
  - this property is also why in LZ78 there is no need to distribute the dictionary alongside the encoded text (in huffman coding, a large percentage of overhead is caused due to the fact that the dictionary/mappings need to be shared alongside the encoded string)
- in this technique the encoded stream is of the form <i,c>
  - /i/ is the index of the longest match found in the text to the right of the cursor in the dictionary
  - /c/ is the character immediately following the longest pattern matched (in the text)
- the process of encoding a string is as follows
  1. start from the first character in the source
  2. find the longest match from the source in the dictionary
  3. if no match is found, emit (0, c) where c is the character currently at the cursor
  4. if a match is found, and there is still some text left in the source after the matched text, emit (i, c) where i is the index in the dictionary to the longest match and c is the character in the text immediately following the matched string
  5. if the entire text from the cursor all the way till the end, emit (i,) where i is the index of the match in the dictionary
  6. increment the cursor by the length of the string matched
  7. repeat 'step 2' till all the input is exhausted
- the choice of data structure used to represent the dictionary will have an effect on the speed of finding matches
- /*parameters*/ :
  - /dictionary size (user-settable)/
    - the main parameter of the LZ78 encoder is the size of the dictionary used
    - this is an important parameter since we cannot allow an unbounded growth in dictionary size

*** Some differences between LZ77 and LZ78 schemes
| LZ77                                                                                 | LZ78                                                                    |
|--------------------------------------------------------------------------------------+-------------------------------------------------------------------------|
| registers patterns from their second appearance                                      | registers patters as and when they are first seen                       |
| for every pattern, there is a need to efficiently search the search buffer           | for every pattern simply find its corresponding entry in the dictionary |
| high configurability (search buffer size, maximum length of match, search algorithm) | only configurability comes from the dictionary size                     |
| computation intensive                                                                | memory intensive                                                        |

As CPUs get faster and memory gets cheaper, different ways to mix and match these basic schemes can help in obtaining optimum performance for the system in consideration.
For example dictionary like hashtables are used in gzip to keep 3 character prefixes and the indices of their appearance in the string, even though it(deflate) is based on the LZSS scheme.

