index.html

<div id="outline-container-orgb229edc" class="outline-4">
<h4 id="orgb229edc"><span class="section-number-4">1.3.1.</span> LZ77</h4>
<div class="outline-text-4" id="text-1-3-1">
<ul class="org-ul">
<li>in the LZ77 algorithm, a cursor is maintain which tells the algorithm which character being processed at the time</li>
<li>all the characters that fall to the left of the cursor (the number of characters to be considered depends on the size set) form the <i>search buffer</i></li>
<li>the characters that fall on the right of the cursor form the <i>look ahead buffer</i></li>
<li>the referenced emitted by the encoder are of the form &lt;o, l, c&gt;
<ul class="org-ul">
<li>o is the offset, how far back from the current cursor position the match was found, or 0 if no match was found</li>
<li>l is the length of the longest match found, or 0 if no match was found</li>
<li>c is the character to the immediate right of the match found, or the character itself if no match was found</li>
</ul></li>
<li>the process followed is as follows:
<ol class="org-ol">
<li>start at the beginning of the string</li>
<li>look backwards <i>N</i> characters and look for the longest match</li>
<li>if there is no match found emit (0, 0, c) where c is the character under the cursor</li>
<li>else emit (o, l, c) according to the descriptions of o, c, l above</li>
<li>repeat from 'step 2' for every character, skipping l characters if match of that length is found else move by 1</li>
</ol></li>
<li>using values of l larger than the dictionary size allows a run-length type encoding to be made
<ul class="org-ul">
<li>if the pattern length is more than search buffer size, copy the search buffer's characters from left to right and circle back to the start till we finish copying 'length' number of characters</li>
</ul></li>
<li>a bit of a problem with the aggressive coding scheme used is that if there are a lot of unmatched characters, instead of just encoding it as the character itself, the encoding is done as 3 numbers which is a waste of a lot of bits
<ul class="org-ul">
<li><i>the schemes that came after this try to fix this problem of over aggressively coding the source (eg: LZSS, snappy)</i></li>
</ul></li>
<li><i><b>parameters</b></i> :
<ul class="org-ul">
<li><i>the size of the search buffer (user-settable)</i>
<ul class="org-ul">
<li>the larger the search buffer
<ul class="org-ul">
<li>the longer back you can search</li>
<li>the more bits you need to represent the offset</li>
<li>but you can get references for things that you may not get references for if the search buffer is small</li>
</ul></li>
</ul></li>
<li><i>maximum value for longest match (user-settable)</i>
<ul class="org-ul">
<li>if the longest match length is large we need more bits to represent its value in memory</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org654408c" class="outline-4">
<h4 id="org654408c"><span class="section-number-4">1.3.2.</span> LZ78</h4>
<div class="outline-text-4" id="text-1-3-2">
<ul class="org-ul">
<li>in the LZ78 algorithm too, a cursor is maintain which tells the algorithm which character being processed at the time</li>
<li>in this algorithm, an explicit dictionary is maintained in memory as the encoding and decoding takes place</li>
<li>the dictionary is maintained in the form of hashtables or tries</li>
<li>the dictionary is filled as the cursor moves from the begginging of the source text to the end, using only the characters/patterns visited till that point
<ul class="org-ul">
<li>this property is important, because it allows the decoder to follow the exact same process as the encoder while decoding</li>
<li>this property is also why in LZ78 there is no need to distribute the dictionary alongside the encoded text (in huffman coding, a large percentage of overhead is caused due to the fact that the dictionary/mappings need to be shared alongside the encoded string)</li>
</ul></li>
<li>in this technique the encoded stream is of the form &lt;i,c&gt;
<ul class="org-ul">
<li><i>i</i> is the index of the longest match found in the text to the right of the cursor in the dictionary</li>
<li><i>c</i> is the character immediately following the longest pattern matched (in the text)</li>
</ul></li>
<li>the process of encoding a string is as follows
<ol class="org-ol">
<li>start from the first character in the source</li>
<li>find the longest match from the source in the dictionary</li>
<li>if no match is found, emit (0, c) where c is the character currently at the cursor</li>
<li>if a match is found, and there is still some text left in the source after the matched text, emit (i, c) where i is the index in the dictionary to the longest match and c is the character in the text immediately following the matched string</li>
<li>if the entire text from the cursor all the way till the end, emit (i,) where i is the index of the match in the dictionary</li>
<li>increment the cursor by the length of the string matched</li>
<li>repeat 'step 2' till all the input is exhausted</li>
</ol></li>
<li>the choice of data structure used to represent the dictionary will have an effect on the speed of finding matches</li>
<li><i><b>parameters</b></i> :
<ul class="org-ul">
<li><i>dictionary size (user-settable)</i>
<ul class="org-ul">
<li>the main parameter of the LZ78 encoder is the size of the dictionary used</li>
<li>this is an important parameter since we cannot allow an unbounded growth in dictionary size</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org0c00bea" class="outline-4">
<h4 id="org0c00bea"><span class="section-number-4">1.3.3.</span> Some differences between LZ77 and LZ78 schemes</h4>
<div class="outline-text-4" id="text-1-3-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">LZ77</th>
<th scope="col" class="org-left">LZ78</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">registers patterns from their second appearance</td>
<td class="org-left">registers patters as and when they are first seen</td>
</tr>

<tr>
<td class="org-left">for every pattern, there is a need to efficiently search the search buffer</td>
<td class="org-left">for every pattern simply find its corresponding entry in the dictionary</td>
</tr>

<tr>
<td class="org-left">high configurability (search buffer size, maximum length of match, search algorithm)</td>
<td class="org-left">only configurability comes from the dictionary size</td>
</tr>

<tr>
<td class="org-left">computation intensive</td>
<td class="org-left">memory intensive</td>
</tr>
</tbody>
</table>

<p>
As CPUs get faster and memory gets cheaper, different ways to mix and match these basic schemes can help in obtaining optimum performance for the system in consideration.
For example dictionary like hashtables are used in gzip to keep 3 character prefixes and the indices of their appearance in the string, even though it(deflate) is based on the LZSS scheme.
</p>
</div>
</div>
