index.org
*** LZSS
- the LZSS scheme tries and improves upon the LZ77 scheme
- to reduce the overhead caused by aggressive overhead of encoding unmatched single characters as <o,l,c> triplets,
  - if a match is found, emit a <o,l> pair for the offset and length of match
  - if a match is found, but its length is less than 3, then just emit the single characters that form the match as that will take lesser memory to encode than encoding it as a reference
  - otherwise, emit only the single unmatched character
- for the decoder to know whether the next unit is an <o,l> pair or a single character, a ONE BIT flag is used as a prefix - 1 for pairs and 0 for single characters
- this the encoded stream looks like 1(,) 0c 0c 1(,)
- this /requires the capability of reading and writing single bits/ to files which may not be possible. In such cases, a /FLAG byte may be used which encodes in its 8 bits the flags for the next 8 units/
- optimiaztions that can be made in the pattern searching algorithm
  - the deflate scheme that powers the gzip format uses an optimization where it uses a hashing scheme that uses the hashes of 3 character prefix sequences to keep track of matches
  - it stores the index of the patterns occurance in the bucket pointed to by the hash of the first 3 characters of the sequence
  - this makes searching for the pattern simpler as we need to just get the hash, linear search the bucket, and if found report the match index in the hashtable, else find the pattern at the locations mentioned in the hashtable where the 3 character sequence is seen and search the source from there
  - This will be faster than just linear searching the search buffer everytime
- /*parameters*/:
  - the parameters for this algorithm are the same as those for the LZ77 algorithm

*** LZW
- the LZW scheme comes under the LZ78 family of schemes
- instead of storing backreferences using indices, it uses extra bits to make a larger set of symbols available and encodes patterns using these extra symbols
- instead of representing each symbol as an 8bit value (0-255), it represents each symbol as a 9bit value (0-511)
- the dictionary is simply like an array of 512 values, the first 256 of which are initialized with the values of their ascii counterparts
- the process of encoding is as follows:
  1. initialize the first 256 entries of the dictionary/table with their ASCII values
  2. read a character
  3. add the character to the 'working string'
  4. if the working string is present in the dictionary/table
     - *true?*
       - do nothing
     - *false?* /(working string is not present in the table)/
       - let S = substring of working string that excludes only the last character in the working string
       - emit the symbol corresponding to S as the encoding
       - add current working string to the table at the first unused entry
       - set the working string as the last character of the working string
  5. repeat 'step 2' until all the text is encoded
- there is an interesting complication that arises when using this technique (called the cScSc case)
  - condition for the situation to occur:
    - encoder recieves a string of the form cScSc where c is a character, S is a string
    - encoder has already in its dictionary/table the entry for cS
    - encoder has not yet in its dictionary/table the entry for cSc
    - when the encoder sees this pattern
      - sees cSc and emits the symbol corresponding to cS from table
      - adds cSc to the dictionary
      - sees second cSc (from the cSc /cSc/) and encodes it directly as the cSc entry
    - an example of this is $another\_banana$ which is encoded as $another\_b(256)(265)$
      - the 'cScSc' pattern here is 'anana' in 'banana'
      - during decoding, when we reach the point of decoding 265, the table has no entry for it.
      - here we solve the case by following the steps mentioned below
  - the decoder may come across a symbol that is not yet present in its dictionary/table
  - in this case, the next entry in the table is required to be guessed
  - this can be done using the fact that the first character of the working string is going to be the first character in the decoded string
  - this means that in case we need, we can use this assumption and append the first character of the working string to the working string itself to produce the next working string.
    - this can be repeated till we find the entry required, within the dictionary/table
- /*parameters*/:
  - the number of bits used per symbol (generally 9bits)
- this technique requires bit reads and bit writes, which may not be available if the system can operate only on bytes
  - in this case we can examine the values of the 9bits used
  - for the regular ASCII characters, we have values that fit in 8bits
    - this means their 9bit representations look like $0 _ _ _ _ _ _ _ _$
  - for the extra 256 symbols that the 9bit representation offers
    - the representations look like $1 _ _ _ _ _ _ _ _$
  - this means that we can treat the first bit as a FLAG /(0=regular ASCII 1=extended characterset)/
  - this allows systems that can operate only on bits to store the flags of the next 8 symbols in a FLAG BYTE

