index.html

<div id="outline-container-org7bc808c" class="outline-4">
<h4 id="org7bc808c"><span class="section-number-4">1.3.4.</span> LZSS</h4>
<div class="outline-text-4" id="text-1-3-4">
<ul class="org-ul">
<li>the LZSS scheme tries and improves upon the LZ77 scheme</li>
<li>to reduce the overhead caused by aggressive overhead of encoding unmatched single characters as &lt;o,l,c&gt; triplets,
<ul class="org-ul">
<li>if a match is found, emit a &lt;o,l&gt; pair for the offset and length of match</li>
<li>if a match is found, but its length is less than 3, then just emit the single characters that form the match as that will take lesser memory to encode than encoding it as a reference</li>
<li>otherwise, emit only the single unmatched character</li>
</ul></li>
<li>for the decoder to know whether the next unit is an &lt;o,l&gt; pair or a single character, a ONE BIT flag is used as a prefix - 1 for pairs and 0 for single characters</li>
<li>this the encoded stream looks like 1(,) 0c 0c 1(,)</li>
<li>this <i>requires the capability of reading and writing single bits</i> to files which may not be possible. In such cases, a <i>FLAG byte may be used which encodes in its 8 bits the flags for the next 8 units</i></li>
<li>optimiaztions that can be made in the pattern searching algorithm
<ul class="org-ul">
<li>the deflate scheme that powers the gzip format uses an optimization where it uses a hashing scheme that uses the hashes of 3 character prefix sequences to keep track of matches</li>
<li>it stores the index of the patterns occurance in the bucket pointed to by the hash of the first 3 characters of the sequence</li>
<li>this makes searching for the pattern simpler as we need to just get the hash, linear search the bucket, and if found report the match index in the hashtable, else find the pattern at the locations mentioned in the hashtable where the 3 character sequence is seen and search the source from there</li>
<li>This will be faster than just linear searching the search buffer everytime</li>
</ul></li>
<li><i><b>parameters</b></i>:
<ul class="org-ul">
<li>the parameters for this algorithm are the same as those for the LZ77 algorithm</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org904ec15" class="outline-4">
<h4 id="org904ec15"><span class="section-number-4">1.3.5.</span> LZW</h4>
<div class="outline-text-4" id="text-1-3-5">
<ul class="org-ul">
<li>the LZW scheme comes under the LZ78 family of schemes</li>
<li>instead of storing backreferences using indices, it uses extra bits to make a larger set of symbols available and encodes patterns using these extra symbols</li>
<li>instead of representing each symbol as an 8bit value (0-255), it represents each symbol as a 9bit value (0-511)</li>
<li>the dictionary is simply like an array of 512 values, the first 256 of which are initialized with the values of their ascii counterparts</li>
<li>the process of encoding is as follows:
<ol class="org-ol">
<li>initialize the first 256 entries of the dictionary/table with their ASCII values</li>
<li>read a character</li>
<li>add the character to the 'working string'</li>
<li>if the working string is present in the dictionary/table
<ul class="org-ul">
<li><b>true?</b>
<ul class="org-ul">
<li>do nothing</li>
</ul></li>
<li><b>false?</b> <i>(working string is not present in the table)</i>
<ul class="org-ul">
<li>let S = substring of working string that excludes only the last character in the working string</li>
<li>emit the symbol corresponding to S as the encoding</li>
<li>add current working string to the table at the first unused entry</li>
<li>set the working string as the last character of the working string</li>
</ul></li>
</ul></li>
<li>repeat 'step 2' until all the text is encoded</li>
</ol></li>
<li>there is an interesting complication that arises when using this technique (called the cScSc case)
<ul class="org-ul">
<li>condition for the situation to occur:
<ul class="org-ul">
<li>encoder recieves a string of the form cScSc where c is a character, S is a string</li>
<li>encoder has already in its dictionary/table the entry for cS</li>
<li>encoder has not yet in its dictionary/table the entry for cSc</li>
<li>when the encoder sees this pattern
<ul class="org-ul">
<li>sees cSc and emits the symbol corresponding to cS from table</li>
<li>adds cSc to the dictionary</li>
<li>sees second cSc (from the cSc <i>cSc</i>) and encodes it directly as the cSc entry</li>
</ul></li>
<li>an example of this is \(another\_banana\) which is encoded as \(another\_b(256)(265)\)
<ul class="org-ul">
<li>the 'cScSc' pattern here is 'anana' in 'banana'</li>
<li>during decoding, when we reach the point of decoding 265, the table has no entry for it.</li>
<li>here we solve the case by following the steps mentioned below</li>
</ul></li>
</ul></li>
<li>the decoder may come across a symbol that is not yet present in its dictionary/table</li>
<li>in this case, the next entry in the table is required to be guessed</li>
<li>this can be done using the fact that the first character of the working string is going to be the first character in the decoded string</li>
<li>this means that in case we need, we can use this assumption and append the first character of the working string to the working string itself to produce the next working string.
<ul class="org-ul">
<li>this can be repeated till we find the entry required, within the dictionary/table</li>
</ul></li>
</ul></li>
<li><i><b>parameters</b></i>:
<ul class="org-ul">
<li>the number of bits used per symbol (generally 9bits)</li>
</ul></li>
<li>this technique requires bit reads and bit writes, which may not be available if the system can operate only on bytes
<ul class="org-ul">
<li>in this case we can examine the values of the 9bits used</li>
<li>for the regular ASCII characters, we have values that fit in 8bits
<ul class="org-ul">
<li>this means their 9bit representations look like \(0 _ _ _ _ _ _ _ _\)</li>
</ul></li>
<li>for the extra 256 symbols that the 9bit representation offers
<ul class="org-ul">
<li>the representations look like \(1 _ _ _ _ _ _ _ _\)</li>
</ul></li>
<li>this means that we can treat the first bit as a FLAG <i>(0=regular ASCII 1=extended characterset)</i></li>
<li>this allows systems that can operate only on bits to store the flags of the next 8 symbols in a FLAG BYTE</li>
</ul></li>
</ul>
</div>
</div>
