index.org
*** snappy
- the snappy scheme belongs to the LZ77 family of schemes
- it is a byte oriented format (that is, everything is byte aligned, /unlike LZSS/)
- the file starts with an uncompressed length of file, in the form of a little endian /"varint"/
  - a /varint/ is a series of bytes such that in each byte, the lower 7 bits represent some data and the upper bit is set only if there are more bits in the same logical unit ahead
  - used by Google in its [[https://carlmastrangelo.com/blog/lets-make-a-varint][Protocol Buffer]] format.
  - to make a varint, we start off with the number we wish to encode, eg: 330
  - the binary representation of 330 is 0000 0001 0100 1010
  - we need to break it into bytes
    - 0000 0001
    - 0100 1010
  - now, in the lowermost bit, we need to set the uppermost bit to signal that the number is multi-byte
  - so we get 0100 1010 -> 0 1100 1010 (the 0 in the beginning is part of the original number and therefore must be preserved
  - then we add the topmost bit (which came out as a single bit) to the first byte
    - 0000 0001 0
  - which then becomes 0000 0010
  - so when we arrange the bits it now says 0000 0010 1100 1010
  - hence the number 0x014a becomes the varint 0x02ca
  - and then the order must be little endian so it becomes 0xca02
- the rest of the file is a stream of compressed data
- the compressed data contains 2 types of elements
  - literals (characters)
  - back-references
- each element is composed of two parts
  - the tag byte
    - lower 2bits of the tag byte tell the type of data of the coming element
    - 00 for literals
    - 01 for references with 1byte long offset
    - 10 for references with 2byte long offset
    - 11 for references with 4byte long offset
  - the data bytes
- Literals
  - tag byte has lower 2bits as 00
  - the rest (upper 6bits) store the length (len-1) of literal sequence incoming
  - if the 6bits are of values 60/61/62/63 then it indicates that the next 1/2/3/4 bytes encode the actual length
  - the next len bits are uncompressed characters
- Back-references/Copies
  - tag bytes 01, 10, 11 code for offsets of varying byte sizes
  - for 01
    - the upper 6bits of tag byte
      - lower three (bits 3,4,5) store the value of "length-4"
      - upper three (bits 6,7,8) store the upper three bits of 11 bit "offset"
    - the next byte stores the lower 8bits of the "offset"
  - for 10
    - upper 6bits of the tag byte stores the "length-1" value
    - next 2 bytes stores the little endian representation of the "offset"
  - for 11
    - upper 6bits of the tag byte stores the "length-1" value
    - next 4 bytes stores the little endian representation of the "offset"
- Unlike other compression formats like gzip, bzip2 snappy does not perform any kind of entropy coding
