index.html

<div id="outline-container-org5b2a874" class="outline-4">
<h4 id="org5b2a874"><span class="section-number-4">1.3.6.</span> snappy</h4>
<div class="outline-text-4" id="text-1-3-6">
<ul class="org-ul">
<li>the snappy scheme belongs to the LZ77 family of schemes</li>
<li>it is a byte oriented format (that is, everything is byte aligned, <i>unlike LZSS</i>)</li>
<li>the file starts with an uncompressed length of file, in the form of a little endian <i>"varint"</i>
<ul class="org-ul">
<li>a <i>varint</i> is a series of bytes such that in each byte, the lower 7 bits represent some data and the upper bit is set only if there are more bits in the same logical unit ahead</li>
<li>used by Google in its <a href="https://carlmastrangelo.com/blog/lets-make-a-varint">Protocol Buffer</a> format.</li>
<li>to make a varint, we start off with the number we wish to encode, eg: 330</li>
<li>the binary representation of 330 is 0000 0001 0100 1010</li>
<li>we need to break it into bytes
<ul class="org-ul">
<li>0000 0001</li>
<li>0100 1010</li>
</ul></li>
<li>now, in the lowermost bit, we need to set the uppermost bit to signal that the number is multi-byte</li>
<li>so we get 0100 1010 -&gt; 0 1100 1010 (the 0 in the beginning is part of the original number and therefore must be preserved</li>
<li>then we add the topmost bit (which came out as a single bit) to the first byte
<ul class="org-ul">
<li>0000 0001 0</li>
</ul></li>
<li>which then becomes 0000 0010</li>
<li>so when we arrange the bits it now says 0000 0010 1100 1010</li>
<li>hence the number 0x014a becomes the varint 0x02ca</li>
<li>and then the order must be little endian so it becomes 0xca02</li>
</ul></li>
<li>the rest of the file is a stream of compressed data</li>
<li>the compressed data contains 2 types of elements
<ul class="org-ul">
<li>literals (characters)</li>
<li>back-references</li>
</ul></li>
<li>each element is composed of two parts
<ul class="org-ul">
<li>the tag byte
<ul class="org-ul">
<li>lower 2bits of the tag byte tell the type of data of the coming element</li>
<li>00 for literals</li>
<li>01 for references with 1byte long offset</li>
<li>10 for references with 2byte long offset</li>
<li>11 for references with 4byte long offset</li>
</ul></li>
<li>the data bytes</li>
</ul></li>
<li>Literals
<ul class="org-ul">
<li>tag byte has lower 2bits as 00</li>
<li>the rest (upper 6bits) store the length (len-1) of literal sequence incoming</li>
<li>if the 6bits are of values 60/61/62/63 then it indicates that the next 1/2/3/4 bytes encode the actual length</li>
<li>the next len bits are uncompressed characters</li>
</ul></li>
<li>Back-references/Copies
<ul class="org-ul">
<li>tag bytes 01, 10, 11 code for offsets of varying byte sizes</li>
<li>for 01
<ul class="org-ul">
<li>the upper 6bits of tag byte
<ul class="org-ul">
<li>lower three (bits 3,4,5) store the value of "length-4"</li>
<li>upper three (bits 6,7,8) store the upper three bits of 11 bit "offset"</li>
</ul></li>
<li>the next byte stores the lower 8bits of the "offset"</li>
</ul></li>
<li>for 10
<ul class="org-ul">
<li>upper 6bits of the tag byte stores the "length-1" value</li>
<li>next 2 bytes stores the little endian representation of the "offset"</li>
</ul></li>
<li>for 11
<ul class="org-ul">
<li>upper 6bits of the tag byte stores the "length-1" value</li>
<li>next 4 bytes stores the little endian representation of the "offset"</li>
</ul></li>
</ul></li>
<li>Unlike other compression formats like gzip, bzip2 snappy does not perform any kind of entropy coding</li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Ashiwn Godbole</p>
<p class="date">Created: 2022-07-10 Sun 17:02</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
